[
    "A classmate compliments your hair today and thinks your curls are just so beautiful that they begin touching and playing with your hair.",
    "A classmate sees you on the phone and that you’re crying and visibly upset. This classmate comes over to you, starts hugging you without asking; all while you are still on the phone.",
    "You’re at a party, chatting with friends and someone takes your hat from your head and dancing around you with it on.",
    "You’re texting a friend about weekend plans when a classmate walks up behind you and starts reading your messages out loud.",
    "You’re in a relationship and your S/O keeps tickling you incessantly but you wish they would stop.",
    "You’re upset with a teammate about the lack of participation on a group project. Another member of the group confronts them but ends up mentioning that you feel the same way they do, on your behalf without asking you.",
    "You’re at a family get together and your mom reveals to your aunt that you lost your virginity, your uncle overhears and blurts it out in front of everyone.",
    "Your friend takes a not so flattering photo of you and posts it to their story for everyone to see. ",
    "You’re out with friends at lunch and the waiter brings out one check, your friends look at you to cover the bill saying “I’ll get the next one”",
    "Your professor touches the small of your back when passing by and it’s too close for comfort. ",
    "You’re at the grocery store shopping and it’s a bit crowded, while you’re going to pick up a cereal box, the person next to you grazes you in a very uncomfortable way. How do you respond?",
    "You’re on the basketball team at the collegiate level, you haven’t completely come out but your teammates keep openly talking about it amongst each other in the locker room.",
    "You’re trying to study in the library and a stranger is loudly talking on their phone right next to you.",
    "You’ve had a bad day but your friends are wanting you to go out, you’ve already said that you want to stay in and chill but they keep harassing you to go out with them. ",
    "You are THAT friend that always falls asleep first at your friend’s places when staying the night, your group of friends have made it a running joke to take funny pictures of you sleeping. They only do this to you and you really wish they’d stop. ",
    "Your coworker calls out sick and unfortunately it causes you to have to cover their shift. You follow them on social media and see that they aren’t really sick. ",
    "You’re working out and you notice that this one person at the gym keeps checking you out, you’re tired of it and would really prefer them to stop looking at you. ",
    "Your coworker knows that you’re a picky eater and keeps asking you to try the food that they bring to work. If you don’t at least try it, they get offended.",
    "You’re in class with your best friend, having a normal conversation. The person behind you wants to feel like they're a part of your social group and keeps eavesdropping and inserting themselves into your private conversation.",
    "You’re having a panic attack. Someone tries to hug you. ",
    "Your dad’s friend keeps sending hearts to your story on social media. They’re 47 and married.",
    "Your partner in class smells badly and keeps scooting closer to you. ",
    "A guy in your class keeps shooting paper balls from across the room and is aiming it directly at your chest. ",
    "Your RA keeps calling you by the wrong pronouns.",
    "You see your friend dressed up in a sacred headdress for halloween, everyone thinks it looks so cool but it’s offensive to your culture. ",
    "You’re studying abroad and have to room with four other girls, some of the girls keep borrowing your clothes.",
    "You’re very obviously a POC and a girl in your sorority who is obviously not, keeps dropping the word that shall not be said to a POC. She sings it in songs, uses it in conversations about the men she dates, it makes you uncomfortable. ",
    "Someone stops you in the middle of a conversation to ask what your ethnicity is.",
    "A classmate sees you upset and tries to give you unsolicited “life changing” advice and a pep talk that you didn’t ask for. ",
    "You’re working on a class project and your classmates keep getting off topic to talk about their sexual lives and how many partners they’ve had. ",
    "You’re working on a project and the girl next to you keeps hovering over your shoulder to see what you’re doing and somewhat copying your work.",
    "You’re at lunch with a friend and they keep chewing with their mouth open, interrupting you and talking with their mouth full of food. ",
    "You’re an artist and someone marks on your work."
]